{
  "AAS 2130": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AAS 2130        ": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEM 1200": {
    "description": "\n            Provides an overview of management and business. Human resource, marketing, finance, and strategy concerns are addressed with consideration paid to current issues such as technological innovation and its impact on operations, globalization, ethics, teamwork, leadership, and entrepreneurship. Opportunity to deliver an integrative group project.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Introduction to Business Management"
  },
  "AEM 1500 ": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEM 2010": {
    "description": "\n            This course emphasizes applied decision making in the business world using Excel as a business analytics tool. The course covers theory behind decision-making and teaches students to apply tools and methods to various business scenarios throughout the semester. Understanding the value of such skills, this course will introduce students to navigating tools and applications, and typical business scenarios where such capabilities can be leveraged in business. Students dedicated to success in this course can expect to achieve a beginner to intermediate knowledge of spreadsheet modeling skills in an Excel platform. Students will enjoy a thorough exposure to real world applications and learn to demonstrate these new capabilities in a business environment. AEM 2010 will help students understand the dynamics of using Excel modeling to solve optimization problems, forecast future outcomes using assumptions and projections, and evaluate problems that involve uncertainty in order to inform business strategy and quantitative decision-making. In business analytic vernacular, students will learn to leverage descriptive, predictive and prescriptive analytic methods using data.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Spreadsheet Modeling for Management and Economics"
  },
  "AEM 2100": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEM 2210": {
    "description": "\n            Comprehensive introduction to financial accounting concepts and techniques, intended to provide a basic understanding of the accounting cycle, elements of financial statements, underlying theory of GAAP, and financial statement interpretation. Topics include methods of recording inventory, receivables, depreciation, bonds, and equity. Requires two evening prelims and a final; weekly homework assignments.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Financial Accounting"
  },
  "AEM 3100": {
    "description": "\n            Focuses on techniques used to analyze data from marketing research, business, and economics. Topics include experimental design and ANOVA, contingency-table analysis, quality-control methods, time-series analysis, and forecasting. Also includes brief introduction to nonparametric methods. Involves a research project designed to give experience in collecting and interpreting data.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Business Statistics"
  },
  "AEP 1100": {
    "description": "\n            Lasers have had an enormous impact on communications, medicine, remote sensing, and material processing. This course reviews the properties of light that are essential to understanding the underlying principles of lasers and these photonic technologies. There also is a strong, hands-on laboratory component in which the students build and operate a nitrogen laser and participate in several demonstration experiments such as holography, laser processing of materials, optical tweezers, and fiber optics.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Lasers and Photonics"
  },
  "AEP 1200": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEP 3200": {
    "description": "\n            Covers review of vector analysis, tensor calculus, Dirac Delta functions, complex variable theory, Cauchy-Rieman conditions, complex Taylor and Laurent series, Cauchy integral formula and residue techniques, conformal mapping, calculus of variations, Fourier Series.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Introductory Mathematical Physics"
  },
  "AEP 3330": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEP 3610": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "AEP 3620": {
    "description": "\n            Continuation of AEP 3610&nbsp;covering more advanced material in quantum mechanics. Topics include operator formalism and matrix representation, angular momentum and spin, the hydrogen atom, techniques for solving Schrodinger's equation including perturbation theory, two- and three-level systems, interaction with radiation, and identical particles.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Intermediate Quantum Mechanics"
  },
  "AMST 1115": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ANSC 4270": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ANSC 4410": {
    "description": "\n            The course will integrate animal nutrition, biochemistry, and physiology. The overall goal is to enhance understanding of intermediary metabolism and metabolic adaptations that develop to support different physiological states. The comparative study of biochemistry across mammalian species will be emphasized. The structural and functional roles of biochemicals and the ability of hormones to influence their metabolic fate will be highlighted.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Metabolic Physiology"
  },
  "ASTRO 1195": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ASTRO 2212": {
    "description": "\n            Introduction to the solar system with emphasis on the quantitative application of simple physical principles to the understanding of what we observe or can deduce. Topics include: planetary orbital and spin dynamics, tidal evolution, the interiors, surfaces, and atmospheres of the planets including the effects of greenhouse gases on climate, and smaller bodies such as satellites, asteroids and comets. Comparisons will be made between planetary systems discovered about other stars and our own solar system. Results from past and current spacecraft missions will be discussed. Final grades will depend on homework sets and on a final team project and in-class presentation, supported by a joint term paper. The course is more in-depth and quantitative than ASTRO 1102/ASTRO 1104. All course materials will be available online.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "The Solar System: Planets, Small Bodies and New Worlds"
  },
  "BEE 2510": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BEE 2600": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BIOAP 4140": {
    "description": "\n            Undergraduate course surveying system- and organ-related aspects of pharmacology. Topics include mechanisms of drug action; drug disposition; pharmacokinetics; autonomic pharmacology; pharmacology of inflammation, allergy and platelet function; and endocrine, cardiovascular, respiratory, gastrointestinal, and renal pharmacology. The course is designed for undergraduate life science majors, particularly those interested in medical or veterinary school.\n        ",
    "distribution": "(BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Principles of Pharmacology"
  },
  "BIOEE 1610": {
    "description": "\n            This course provides an introduction to ecology, covering interactions between organisms and the environment at scales of populations, communities, and ecosystems. Ecological principles are used to explore the theory and applications of major issues facing humanity in the 21st century, including population dynamics, disease ecology, biodiversity and invasive species, global change, and other topics of environmental sustainability.\n        ",
    "distribution": "(BIO-AG, BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Introductory Biology: Ecology and the Environment"
  },
  "BIOEE 4500": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BIOG 1440": {
    "description": "\n            An introductory physiology course intended for first-year and sophomore biological sciences majors and other students majoring in life sciences. The course integrates physiology from the cell to the organism with comparisons among animals, plants and microbes. Emphasis is on understanding of basic physiological concepts, stressing structure-function relationships and underlying physio-chemical mechanisms.\n        ",
    "distribution": "(BIO-AG, BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Introductory Biology: Comparative Physiology"
  },
  "BIOG 1445": {
    "description": "\n            The course focuses on the understanding of how different biological organisms (animals, plants, microbes) perform common physiological functions.\n        ",
    "distribution": "(BIO-AG, BIO-AS, PBS-AS)",
    "credits": "4",
    "Name": "Introduction to Comparative Anatomy and Physiology, Individualized Instruction"
  },
  "BIOMG 1350": {
    "description": "\n            The course introduces molecular mechanisms that underlie the organization, division, and growth of individual cells; how they organize during embryonic development to form functional tissues and organs in multicellular organisms; and how their misbehavior contributes to disease. Students seeking additional help with the material taught in BIOMG 1350 should consider the active learning supplemental class BIOMG 1035&nbsp;(see course catalog for details). The learning outcomes below indicate the topics and skills that students should master upon completion of the course.\n        ",
    "distribution": "(BIO-AG, BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Introductory Biology: Cell and Developmental Biology"
  },
  "BIOMG 2800": {
    "description": "\n            General introduction to the fundamental principles of genetics in eukaryotes and bacteria. Topics include: gene transmission, linkage, recombination, structure, mutations, and manipulation, as well as analysis of genomes in individuals and populations.\n        ",
    "distribution": "(BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Lectures in Genetics and Genomics"
  },
  "BIOMG 2801": {
    "description": "\n            General introduction to laboratory experimental genetics. Topics include gene transmission, linkage, recombination, gene structure, mutations, and manipulation.&nbsp;\n        ",
    "distribution": "(OPHLS-AG)",
    "credits": "2",
    "Name": "Laboratory in Genetics and Genomics"
  },
  "BIOMG 3300": {
    "description": "\n            Thirteen units that cover protein structure and function, enzymes, basic metabolic pathways, DNA, RNA, protein synthesis, and an introduction to recombinant DNA techniques. No formal lectures, auto-tutorial format.\n        ",
    "distribution": "(BIO-AS, PBS-AS)",
    "credits": "4",
    "Name": "Principles of Biochemistry, Individualized Instruction"
  },
  "BIOMI 2600": {
    "description": "\n            This course provides an introduction to the microbiology of microbial diseases. The primary focus is on molecular mechanisms of pathogenesis, including detection of the host environment, binding of pathogenic microbes to host cell surfaces and their invasion of host cells and tissues, and the delivery and functions of microbial toxins. It will include host defenses and microbial countermeasures against these defenses. We will also study the evolution of pathogens and the co-evolution of their hosts.\n        ",
    "distribution": "(BIO-AS, PBS-AS)",
    "credits": "3",
    "Name": "Microbiology of Human Contagious Diseases"
  },
  "BME 2000": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BME 2010": {
    "description": "\n            Covers essentials of human physiology, with an overview of complementary mechanisms of homeostasis and disease pathogenesis. Topics presented in a modular format incorporating an overview of basic physiological mechanisms and key diseases of specific organ systems susceptible to alterations in that physiological mechanism. Topics include: filtration and renal function, electrophysiology and cardiac arrhythmia, neural transmission and muscular dystrophy, mineral balance and osteoporosis, and lipid transport and atherosclerosis. Course utilizes best pedagogical strategies including engaged learning practices, small group discussion, and lectures by clinicians working in these areas.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Physiology of Human Health and Disease"
  },
  "BME 2110": {
    "description": "\n            This course serves as an introduction to thermodynamics and physical chemistry focused on the application to biomolecular systems. Topics include the role of entropy and free energy in determining biological reactions and processes such as enzymatic reactions or molecular interactions, protein folding/unfolding, single molecule mechanics, energy states, and equilibrium distribution of biomolecular and other systems.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Biomolecular Thermodynamics"
  },
  "BME 2210": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BME 3010": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BME 4010": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BTRY 3010": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "BTRY 3020": {
    "description": "\n            Applies linear statistical methods to quantitative problems addressed in biological and environmental research. Methods include linear regression, inference, model assumption evaluation, the likelihood approach, matrix formulation, generalized linear models, single-factor and multifactor analysis of variance (ANOVA), and a brief foray into nonlinear modeling. Carries out applied analysis in a statistical computing environment.\n        ",
    "distribution": "(OPHLS-AG)",
    "credits": "4",
    "Name": "Biological Statistics II"
  },
  "BTRY 4030": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CEE 3040": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CEE 3310": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEM 1560": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEM 1570": {
    "description": "\n            Introduction to organic chemistry concepts with emphasis on structure, reactivity, and mechanisms of carbon compounds relevant to the life sciences.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "Introduction to Organic and Biological Chemistry"
  },
  "CHEM 2150": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEM 2510": {
    "description": "\n            Introduction to the synthesis, separation, characterization, and handling of materials, including chromatography, extraction, crystallization, infrared spectroscopy, and others. An experiment is performed the first week of lab. Students need to enroll in the course Canvas site and complete the appropriate pre-lab assignments outlined on that site before coming to the first lab.\n        ",
    "distribution": null,
    "credits": "2",
    "Name": "Introduction to Experimental Organic Chemistry"
  },
  "CHEM 2900": {
    "description": "\n            Survey of the methods basic to the experimental study of physical chemistry, with a focus on the areas of chemical equilibrium, kinetics, thermodynamics, and molecular spectroscopy.\n        ",
    "distribution": null,
    "credits": "2",
    "Name": "Introductory Physical Chemistry Laboratory"
  },
  "CHEM 3010": {
    "description": "\n            Introduction to the techniques of synthetic organic chemistry. A representative selection of the most important classes of organic reactions is explored in the first half of the semester, augmented by lectures on the reaction chemistry and the theory of separation and characterization techniques.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "5",
    "Name": "Honors Experimental Chemistry I"
  },
  "CHEM 3590": {
    "description": "\n            The course provides an intensive introduction to organic chemistry as a solid foundation for subsequent study in the fields of chemical, biological, materials and physical sciences. Students will learn a set of important tools and concepts that will enable appreciation and powerful application of modern organic chemistry.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "Honors Organic Chemistry I"
  },
  "CHEM 3600": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEM 3890": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEM 3900": {
    "description": "\n            CHEM 3900 is a continuation of CHEM 3890&nbsp;and discusses the thermodynamic behavior of macroscopic systems in the context of quantum and statistical mechanics. After an introduction to the behavior of ensembles of quantum mechanical particles, the laws of thermodynamics, concepts of equilibrium, and&nbsp;chemical kinetics are covered in detail.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Honors Physical Chemistry II"
  },
  "CHEM 4100": {
    "description": "\n            Discussion of chemical bonding and reactivity with an emphasis on the transition metals. A \"ground up\" approach will be taken, building bonding models from atomic electronic structure to molecular orbital theory. Course will also introduce concepts germane to solid state chemistry, bioinorganic chemistry, and organometallic catalysis.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "Inorganic Chemistry"
  },
  "CHEME 1800": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEME 2200": {
    "description": "\n            Applications of quantum chemistry to (1) the interaction of electromagnetic radiation with matter for spectroscopy and strategic bond breaking and (2) the behavior of electrons in solids – insulators, conductors, and semiconductors. Quantum and statistical mechanics for classical thermodynamics – 1st and 2nd laws, phase equilibrium, chemical equilibrium, and heat pumps. Devising rate equations for chemical reactor design from experiment and theory – kinetic theory of gases and transition state theory.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Physical Chemistry II for Engineers"
  },
  "CHEME 2880": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "CHEME 3230": {
    "description": "\n            Fundamentals of fluid mechanics. Macroscopic and microscopic balances. Applications to problems involving viscous flow.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Fluid Mechanics"
  },
  "COMM 2850": {
    "description": "\n            Environmental problems, public health issues, scientific research-in each of these areas, communication plays a fundamental role. From the media to individual conversations, from technical journals to textbooks, from lab notes to the web, communication helps define scientifically based social issues and research findings. This course examines the institutional and intellectual contexts, processes, and practical constraints on communication in the sciences.\n        ",
    "distribution": "(SBA-AG)",
    "credits": "3",
    "Name": "Communication, Environment, Science, and Health"
  },
  "CRP 3840": {
    "description": "\n            Cities are centers of innovation, economic growth, social mobility, and they provide economies of scale in the provision of infrastructure and social services. However, cities are also sites of growing socio-economic inequalities and environmental problems. Do cities provide the opportunity to address environmental problems, or are they rather the source of pollution and environmental degradation? Are cities the appropriate scale at which to address environmental problems? Are these really urban issues or do cities just cluster resource use and problems so they are more visible? What role does the built or physical environment have in impacting our behavior and decision making? This course examines social, economic, cultural, political and environmental dimensions of sustainability and sustainable development in&nbsp;urban areas.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Green Cities"
  },
  "CS 1110": {
    "description": "\n            Programming and problem solving using Python. Emphasizes principles of software development, style, and testing. Topics include procedures and functions, iteration, recursion, arrays and vectors, strings, an operational model of procedure and function calls, algorithms, exceptions, object-oriented programming. Weekly labs provide guided practice on the computer, with staff present to help.&nbsp;\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Introduction to Computing: A Design and Development Perspective"
  },
  "CS 2800": {
    "description": "\n            Covers the mathematics that underlies most of computer science. Topics include mathematical induction; logical proof; propositional and predicate calculus; combinatorics and discrete mathematics; some basic elements of basic probability theory; basic number theory; sets, functions, and relations; graphs; and finite-state machines. These topics are discussed in the context of applications to many areas of computer science, such as the RSA cryptosystem and web searching.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Discrete Structures"
  },
  "CS 3110": {
    "description": "\n            Advanced programming course that emphasizes functional programming techniques and data structures. Programming topics include recursive and higher-order procedures, models of programming language evaluation and compilation, type systems, and polymorphism. Data structures and algorithms covered include graph algorithms, balanced trees, memory heaps, and garbage collection. Also covers techniques for analyzing program performance and correctness.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Data Structures and Functional Programming"
  },
  "CS 3410": {
    "description": "\n            Introduction to computer organization, systems programming and the hardware/ software interface. Topics include instruction sets, computer arithmetic, datapath design, data formats, addressing modes, memory hierarchies including caches and virtual memory, I/O devices, bus-based I/O systems, and multicore architectures. Students learn assembly language programming and design a pipelined RISC processor.\n        ",
    "distribution": "(SMR-AS)",
    "credits": "4",
    "Name": "Computer System Organization and Programming"
  },
  "CS 4110": {
    "description": "\n            An introduction to the theory, design, and implementation of programming languages. Topics include operational semantics, type systems, higher-order functions, scope, lambda calculus, laziness, exceptions, side effects, continuations, objects, and modules. Also discussed are logic programming, concurrency, and distributed programming.\n        ",
    "distribution": "(SMR-AS)",
    "credits": "4",
    "Name": "Programming Languages and Logics"
  },
  "CS 4410": {
    "description": "\n            Introduction to the design of systems programs, with emphasis on multiprogrammed operating systems. Topics include concurrency, synchronization, deadlocks, memory management, protection, input-output methods, networking, file systems and security. The impact of network and distributed computing environments on operating systems is also discussed.\n        ",
    "distribution": "(SMR-AS)",
    "credits": "3",
    "Name": "Operating Systems"
  },
  "CS 4414": {
    "description": -1,
    "distribution": null,
    "credits": -1
  },
  "CS 4620": {
    "description": -1,
    "distribution": null,
    "credits": -1
  },
  "CS 4700": {
    "description": "\n            Challenging introduction to the major subareas and current research directions in artificial intelligence. Topics include: knowledge representation, heuristic search, problem solving, natural-language processing, game-playing, logic and deduction, planning, and machine learning.\n        ",
    "distribution": "(SMR-AS)",
    "credits": "3",
    "Name": "Foundations of Artificial Intelligence"
  },
  "CS 4740": {
    "description": -1,
    "distribution": null,
    "credits": -1
  },
  "CS 4780": {
    "description": "\n            The course provides an introduction to machine learning, focusing on supervised learning and its theoretical foundations. Topics include regularized linear models, boosting, kernels, deep networks, generative models, online learning, and ethical questions arising in ML applications.\n        ",
    "distribution": "(SDS-AS)",
    "credits": "4",
    "Name": "Introduction to Machine Learning"
  },
  "CS 4820": {
    "description": "\n            Develops techniques used in the design and analysis of algorithms, with an emphasis on problems arising in computing applications. Example applications are drawn from systems and networks, artificial intelligence, computer vision, data mining, and computational biology. This course covers four major algorithm design techniques (greedy algorithms, divide-and-conquer, dynamic programming, and network flow), undecidability and NP-completeness, and algorithmic techniques for intractable problems (including identification of structured special cases , approximation algorithms, local search heuristics, and online algorithms).\n        ",
    "distribution": "(SMR-AS)",
    "credits": "4",
    "Name": "Introduction to Analysis of Algorithms"
  },
  "CS 4860": {
    "description": -1,
    "distribution": null,
    "credits": -1
  },
  "CS 4999": {
    "description": "\n            Independent reading and research for undergraduates.\n        ",
    "distribution": null,
    "credits": "1-4",
    "Name": "Independent Reading and Research"
  },
  "EAS 1330": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "EAS 1540": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "EAS 1600": {
    "description": "\n            Fundamentals of radiation, thermodynamics, and mechanics will be introduced and used to understand energy and mass transfers in natural and built environments. Students will describe, identify and use basic principles of physics to discuss and assess renewable energy systems and solve environmental physics problems, using a physics vocabulary and appropriately quantifying results. The course is offered in the spring semester as a flipped class, meeting twice weekly. The course is offered in the fall semester as a web-based, online course and covers the same material.\n        ",
    "distribution": "(OPHLS-AG, PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "Environmental Physics"
  },
  "EAS 2550": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "EAS 2900": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "EAS 3410": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ECE 2300": {
    "description": "\n            This course provides an introduction to the design and implementation of digital circuits and microprocessors. Topics include transistor network design, Boolean algebra, combinational circuits, sequential circuits, finite state machine design, processor pipelines, and memory hierarchy. Design methodology using both discrete components and hardware description languages is covered in the laboratory portion of the course.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Digital Logic and Computer Organization"
  },
  "ECE 3030": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ECON 1110": {
    "description": "\n            Explanation and evaluation of how the price system operates in determining what goods are produced, how goods are produced, who receives income, and how the price system is modified and influenced by private organizations and government policy.\n        ",
    "distribution": "(SBA-AS, SSC-AS)",
    "credits": "3",
    "Name": "Introductory Microeconomics"
  },
  "ECON 1120": {
    "description": "\n            Analysis of aggregate economic activity in relation to the level, stability, and growth of national income. Topics may include the determination and effects of unemployment, inflation, balance of payments, deficits, and economic development, and how these may be influenced by monetary, fiscal, and other policies.\n        ",
    "distribution": "(SBA-AS, SSC-AS)",
    "credits": "3",
    "Name": "Introductory Macroeconomics"
  },
  "ECON 3030": {
    "description": "\n            The pricing processes in a private enterprise economy are analyzed under varying competitive conditions, and their role in the allocation of resources and the functional distribution of national income is considered.\n        ",
    "distribution": "(SBA-AS, SSC-AS)",
    "credits": "4",
    "Name": "Intermediate Microeconomic Theory"
  },
  "ECON 3040": {
    "description": "\n            Introduces the theory of national income and determination and economic growth in alternative models of the national economy. Examines the interaction and relation of these models to empirical aggregate economic data. Reviews national accounts, output and employment determination, price stability and economic growth, in the context of alternative government policy programs and the impact of globalization.\n        ",
    "distribution": "(SBA-AS, SSC-AS)",
    "credits": "4",
    "Name": "Intermediate Macroeconomic Theory"
  },
  "ECON 3110": {
    "description": "\n            This course provides an introduction to probability and parametric inference. Topics include: random variables, standard distributions, the law of large numbers, the central limit theorem, likelihood-based estimation, sampling distributions and hypothesis testing.\n        ",
    "distribution": "(MQR-AS, SDS-AS, SMR-AS)",
    "credits": "4",
    "Name": "Probability Models and Inference for the Social Sciences"
  },
  "ECON 3130": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ECON 3140": {
    "description": "\n            Introduction to the theory and application of econometric techniques. Emphasis is on foundations and development of econometric models, focusing on how a theoretical economic model can be placed into a statistical framework where data is used for the purposes of prediction/forecasting, measurement, and/or testing of economic theory. Topics include estimation and inference in bivariate and multiple regression models, instrumental variables, regression with qualitative information, heteroskedasticity, serial correlation.\n        ",
    "distribution": "(MQR-AS, SDS-AS, SSC-AS)",
    "credits": "4",
    "Name": "Econometrics"
  },
  "ECON 3801": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ECON 4020": {
    "description": "\n            Studies mathematical models of conflict and cooperation in situations of uncertainty (about nature and about decision makers).\n        ",
    "distribution": "(MQR-AS, SMR-AS, SSC-AS)",
    "credits": "3",
    "Name": "Game Theory I"
  },
  "ECON 4260": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ECON 4660": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ENGRD 2020": {
    "description": "\n            This course presents the methods for analyzing deformable structures in equilibrium. It is fundamental to mechanical analysis and design and is the basis for many advanced courses and professions in mechanical, civil, materials, biomedical and biological engineering.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Statics and Mechanics of Solids"
  },
  "ENGRD 2250": {
    "description": "\n            EAS 2250 provides a broad math-, physics-, and chemistry-based introduction to the earth sciences, including geology, paleontology, oceanography, and atmospheric science. Topics covered include formation of the Earth, the chemistry and physics of the Earth's interior, plate tectonics, weathering and erosion, soil development, stream and groundwater flow, volcanism and crustal deformation, the evolution of life, ocean and atmospheric structure, circulation and heat transport, ocean waves and tides, generation of storms, seawater chemistry, mineral and energy resources, and climate change.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "The Earth System"
  },
  "ENGRD 2550": {
    "description": "\n            This course examines the physical hardware of quantum information processing, quantum communication, and quantum sensing technologies. Topics include an analysis of qubit attributes and an introduction to the operational principles of physical qubits. Specific systems will include photonic circuits, trapped ions, superconducting quantum circuits, isolated solid-state spins and quantum dots.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Engineering Quantum Information Hardware"
  },
  "ENGRD 3200": {
    "description": "\n            Introduction to numerical methods, computational mathematics, and probability and statistics. Development of programming and graphics proficiency with MATLAB and spreadsheets. Topics include Taylor-series approximations, numerical errors, condition numbers, operation counts, convergence, and stability, probability distributions, hypothesis testing. Included are numerical methods for solving engineering problems that entail roots of functions, simultaneous linear equations, statistics, regression, interpolation, numerical differentiation and integration, and solution of ordinary and partial differential equations, including an introduction to finite difference methods. Applications are drawn from different areas of engineering. A group project uses these methods on a realistic engineering problem.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Engineering Computation"
  },
  "ENGRG 3400": {
    "description": "\n            Intended for student members of Engineering Student Project Teams. Project Team students work in an applied setting that fosters knowledge transfer from the classroom to practice and development of professional skills necessary to work in multidisciplinary teams. Students will regularly attend team meetings as well as work on their own. An individual final deliverable on the project is required of each student.\n        ",
    "distribution": null,
    "credits": "1-3",
    "Name": "Engineering Student Project Teams"
  },
  "ENGRI 1101": {
    "description": "\n            Introduction to the problems and methods of operations research and information engineering focusing on problem areas (including inventory, network design, and resource allocation), the situations in which these problems arise, and several standard solution techniques. In the computational laboratory, students encounter problem simulations and use some standard commercial software packages.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Engineering Applications of Operations Research"
  },
  "ENGRI 1160": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ENGRI 1210": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "GERST 2000": {
    "description": "\n            Students examine important aspects of present-day German culture while expanding and strengthening their reading, writing, and speaking skills in German. Materials for each topic are selected from a variety of sources (fiction, newspapers, magazines, and the Internet). Units address a variety of topics including studying at a German university, modern literature, Germany online, and Germany at the turn of the century. Oral and written work and individual and group presentations emphasize accurate and idiomatic expression in German. Successful completion of the course enables students to continue with more advanced courses in language, literature, and culture.\n        ",
    "distribution": "(ALC-AS, CA-AS)",
    "credits": "3",
    "Name": "Germany: Intercultural Context"
  },
  "GOVT 1111": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "GOVT 1817": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "GOVT 2432": {
    "description": "\n            The course concerns the principles and philosophical arguments underlying conflicts and moral dilemmas of central and ongoing concern to society as they arise within legal contexts. We consider questions such as what justifies using state power to punish people for wrongdoing, what kinds of conduct are rightly criminalized, what justifies the Supreme Court's power to strike down Congressional legislation, what justifies the right to private property and its boundaries, what is the right to privacy and why it is important, what are human rights, and what is the morality and law of war. Throughout we will be reading legal cases and philosophical commentaries that engage with the deep issues that the cases pose.\n        ",
    "distribution": "(ETM-AS, KCM-AS, SCD-AS)",
    "credits": "4",
    "Name": "Moral Dilemmas in the Law"
  },
  "HADM 1150": {
    "description": "\n            This course provides students with the theoretical lenses and interpersonal skills required to become effective leaders of themselves and others at all organizational levels. With a particular emphasis on the hospitality industry, students develop an understanding and appreciation of the complexities of leading and managing individuals, teams and organizations, and acquire practical tools for accomplishing personal leadership and organizational goals within a service-based framework. Topics include understanding individual differences, leveraging conflict management, applying team-based problem-solving, understanding power and influence dynamics, principles of motivation, coaching and leadership, understanding of group process, and ethics.&nbsp; The course emphasizes practical application of all concepts to students' personal and professional lives and goals, with particular emphasis on work-life in hospitality and broadly, service contexts. Students learn through the use of case studies, self-assessments, experiential exercises, readings, discussions, papers, and group activities.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Organizational Behavior and Leadership Skills"
  },
  "HADM 1210": {
    "description": "\n            An introduction to financial accounting that studies transaction analysis, the balance sheet, income statement, statement of cash flows, and the statement of stockholder's equity. Accounting for investments, receivables, inventories, tangible and intangible assets, liabilities, long term bonds and capital stock transactions are studied. Basic financial ratios are introduced and interpreted. Ethical issues related to financial reporting are also discussed. Students who complete this course will have the pre-requisite knowledge to take HADM 2210&nbsp; Managerial Accounting and HADM 2220&nbsp;Finance.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Financial Accounting"
  },
  "HADM 1350": {
    "description": "\n            This course will cover two broad topics: I) an overview of the hotel industry, and II) the operations of the Rooms Division of a hotel.&nbsp;&nbsp;&nbsp;It will also serve as a 'survey course' by introducing a wide range of topics that students will study in more depth in future courses.&nbsp;&nbsp;\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Introduction to Hotel Operations"
  },
  "HADM 1650": {
    "description": "\n            Introduces the role and importance of effective communication in managerial work, especially in the hospitality industry. Students develop abilities in analytical thinking and clear expression. With an emphasis on business writing, this course builds foundational skills for creating professional-level communications. Students plan, develop, and produce increasingly complex written communications and deliver oral presentations.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Business Writing for Hospitality Professionals"
  },
  "HADM 2210": {
    "description": "\n            This course focuses on the use of accounting information for management decision making and control in hospitality settings. Topics include costing objects, budgeting, financial decision making, cost behavior, and management control systems. There will be one common final exam at the end of the semester.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Managerial Accounting"
  },
  "HADM 2220": {
    "description": "\n            This course provides an introduction to core ideas in finance as well as a foundation for further study.&nbsp; Upon completion of this course students should be able to (1) perform basic valuation of cash flows from projects, bonds, and stocks; (2) demonstrate basic understanding of capital budgeting decisions through the use of concepts including the time value of money and discounted cash flow analysis; (3) assess the relation between risk and return and integrate that knowledge in determining corporate cost of capital; and (4) demonstrate an understanding of the role of debt and equity in corporate capital structure.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Finance"
  },
  "HADM 2250": {
    "description": "\n            This course provides an introduction to core ideas in finance as well as a foundation for further study. Upon completion of this course students should be able to (1) perform basic valuation of cash flows from projects, bonds, and stocks; (2) demonstrate basic understanding of capital budgeting decisions through the use of concepts including the time value of money and discounted cash flow analysis; (3) assess the relation between risk and return and integrate that knowledge in determining corporate cost of capital; and (4) demonstrate an understanding of the role of debt and equity in corporate capital structure.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Finance"
  },
  "HADM 2360": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "HADM 2410": {
    "description": "\n            This is a foundational marketing course that includes the study of concepts, activities, and decisions related to the exchange process, managing the marketing mix, and development of marketing strategy in for-profit and not-for-profit organizations. Students learn about basic principles of marketing management, with a special focus on the service industry. Emphasis is placed upon how the concepts and ideas might be applied to various marketing decision-making situations.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Marketing Principles"
  },
  "HADM 2430": {
    "description": "\n            Students develop an understanding of marketing management for hospitality and related service organizations: the process through which organizations analyze, plan, implement, and control programs to develop and maintain beneficial exchanges with target buyers. Students learn about marketing management through a mix of readings, lectures, class discussions, individual and group exercises, industry guest speakers, and exams.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Marketing Management for Services"
  },
  "HADM 2550": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "HIST 1511": {
    "description": "\n            How do we make sense of the Brexit vote in Great-Britain, the rise of political Islam and the \"veil\" debates in France, the anti-globalization movements in Spain and Greece, the growth of demagogic anti-immigrant parties from the Netherlands to Italy, or the fact that Swedes get more than thirty paid days off per year?&nbsp; This course seeks to answer these questions by exploring the history of modern Europe.&nbsp; Among other themes, we will discuss the Protestant Reformation, the rise of absolutism, the Enlightenment, the French Revolution, industrialism, colonialism, the Russian Revolution, the two world wars, decolonization and immigration, May '68, and the construction of the European Union.&nbsp; In conjunction, we will examine how modern ideologies (liberalism, Marxism, imperialism, conservatism, fascism, totalitarianism) were developed and challenged.&nbsp; Through a wide array of historical documents (fiction, letters, philosophy, treatises, manifestoes, films, and art), we will consider why \"old Europe\" is still relevant for us today.\n        ",
    "distribution": "(HA-AS, HST-AS)",
    "credits": "3-4",
    "Name": "The Making of Modern Europe, from 1500 to the Present"
  },
  "HIST 2590": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "HIST 2958": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "HIST 2969": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ILRLE 2400": {
    "description": "\n            Applies the theory and elementary tools of economics to the characteristics and problems of the labor market. Considers both the demand (employer) and supply (employee) sides of the market to gain a deeper understanding of the effects of various government programs and private decisions targeted at the labor market. Topics include employment demand, basic compensation determination, education and training, benefits and the structure of compensation, labor-force participation and its relation to household production, occupational choice, migration, labor-market discrimination, and the effects of unions.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Economics of Wages and Employment"
  },
  "ILRLR 2050": {
    "description": "\n            A comprehensive introduction to the labor relations systems of the United States and other countries. Covers the determinants of bargaining power, the process of labor agreement negotiation and administration, and assessment of the effects that collective representation exerts on economic and social outcomes. Special consideration is given to the increasing importance of new technology and international factors including global supply chains.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Labor Relations"
  },
  "INFO 2040": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "INFO 2950": {
    "description": "\n            INFO 2950 is an applied introductory course on the foundations of data science, focusing on using data to identify patterns, evaluating the strength and significance of relationships, and generating predictions using data. Topics covered include the core principles of statistical programming (such as data frames, Python/R packages, reproducible workflows, and version control), univariate and multivariate statistical analysis of small and medium-size datasets, regression methods, hypothesis testing, probability models, basic supervised and unsupervised machine learning, data visualization, and network analysis. Students will learn how to use data to make effective arguments in a way that promotes the ethical usage of data. Students who complete the course will be able to produce meaningful, data-driven analyses of real-world problems and will be prepared to begin more advanced work in data-intensive domains.\n        ",
    "distribution": "(MQR-AS, SDS-AS)",
    "credits": "4",
    "Name": "Introduction to Data Science"
  },
  "MAE 3230": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MAE 3240": {
    "description": "\n            This is the first course in heat transfer, with an emphasis on understanding the fundamental physics underlying different heat transfer processes, making proper approximations for analytical heat transfer calculations and numerical methods for engineering heat transfer analysis. Topics include: introduction to three modes of heat transfer, thermal resistance network analysis, steady-state conduction, transient conduction, numerical methods for heat conduction and convection using ANSYS, free convection, heat exchangers, radiation processes and properties.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Heat Transfer"
  },
  "MAE 3260": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MAE 4510": {
    "description": "\n            Introduction to air and rocket&nbsp;propulsion. Emphasis on air-breathing gas-turbines. Chemical rocket propulsion. Brief discussion of of ramjets and of propellers. Application of thermodynamic and fluid-mechanical principles to analysis of performance and design, including fuel efficiency and environmental impacts.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Propulsion of Aircraft and Rockets"
  },
  "MATH 1110": {
    "description": "\n            Topics include functions and graphs, limits and continuity, differentiation and integration of algebraic, trigonometric, inverse trig, logarithmic, and exponential functions; applications of differentiation, including graphing, max-min problems, tangent line approximation, implicit differentiation, and applications to the sciences; the mean value theorem; and antiderivatives, definite and indefinite integrals, the fundamental theorem of calculus, and the area under a curve.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Calculus I"
  },
  "MATH 1120": {
    "description": "\n            Focuses on integration: applications, including volumes and arc length; techniques of integration, approximate integration with error estimates, improper integrals, differential equations and their applications. Also covers infinite sequences and series: definition and tests for convergence, power series, Taylor series with remainder, and parametric equations.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Calculus II"
  },
  "MATH 1220": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MATH 1910": {
    "description": "\n            Essentially a second course in calculus. Topics include techniques of integration, finding areas and volumes by integration, exponential growth, partial fractions, infinite sequences and series, tests of convergence, and power series.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Calculus for Engineers"
  },
  "MATH 1920": {
    "description": "\n            Introduction to multivariable calculus. Topics include partial derivatives, double and triple integrals, line and surface integrals, vector fields, Green's theorem, Stokes' theorem, and the divergence theorem.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Multivariable Calculus for Engineers"
  },
  "MATH 2210": {
    "description": "\n            Topics include vector algebra, linear transformations, matrices, determinants, orthogonality, eigenvalues, and eigenvectors. Applications are made to linear differential or difference equations. The lectures introduce students to formal proofs. Students are required to produce some proofs in their homework and on exams.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Linear Algebra"
  },
  "MATH 2211": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MATH 2220": {
    "description": "\n            Differential and integral calculus of functions in several variables, line and surface integrals as well as the theorems of Green, Stokes, and Gauss.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Multivariable Calculus"
  },
  "MATH 2230": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MATH 2930": {
    "description": "\n            Introduction to ordinary and partial differential equations. Topics include: first-order equations (separable, linear, homogeneous, exact); mathematical modeling (e.g., population growth, terminal velocity); qualitative methods (slope fields, phase plots, equilibria, and stability); numerical methods; second-order equations (method of undetermined coefficients, application to oscillations and resonance, boundary-value problems and eigenvalues); and Fourier series. A substantial part of this course involves partial differential equations, such as the heat equation, the wave equation, and Laplace's equation. (This part must be present in any outside course being considered for transfer credit to Cornell as a substitute for MATH 2930.)\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Differential Equations for Engineers"
  },
  "MATH 2940": {
    "description": "\n            Linear algebra and its applications. Topics include: matrices, determinants, vector spaces, eigenvalues and eigenvectors, orthogonality and inner product spaces; applications include brief introductions to difference equations, Markov chains, and systems of linear ordinary differential equations. May include computer use in solving problems.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Linear Algebra for Engineers"
  },
  "MATH 3110": {
    "description": "\n            Provides a transition from calculus to real analysis. Topics include rigorous treatment of fundamental concepts in calculus: including limits and convergence of sequences and series, compact sets; continuity, uniform continuity and differentiability of functions. Emphasis is placed upon understanding and constructing mathematical proofs.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Introduction to Analysis"
  },
  "MATH 3320": {
    "description": "\n            An introductory course on number theory, the branch of algebra that studies the deeper properties of integers and their generalizations. Usually includes most of the following topics: the Euclidean algorithm, continued fractions, Pythagorean triples, Diophantine equations such as Pell's equation, congruences, quadratic reciprocity, binary quadratic forms, Gaussian integers, and factorization in quadratic number fields. May include a brief introduction to Fermat's Last Theorem.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Introduction to Number Theory"
  },
  "MATH 4280": {
    "description": "\n            Topics are selected from first-order quasilinear equations, classification of second-order equations, with emphasis on maximum principles, existence, uniqueness, stability, Fourier series methods, approximation methods.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Introduction to Partial Differential Equations"
  },
  "MATH 4710": {
    "description": "\n            Introduction to probability theory, which prepares the student to take MATH 4720. The course begins with basics: combinatorial probability, mean and variance, independence, conditional probability, and Bayes formula. Density and distribution functions and their properties are introduced. The law of large numbers and the central limit theorem are stated and their implications for statistics are discussed.\n        ",
    "distribution": "(MQR-AS, SMR-AS)",
    "credits": "4",
    "Name": "Basic Probability"
  },
  "MSE 2060": {
    "description": "\n            This course covers the atomic and molecular structure of crystalline and noncrystalline materials as well as selected analytical techniques for structural interrogation. Selected topics include, basic elements of structure; order and disorder; crystals; semicrystalline materials; amorphous materials; molecular materials; x-ray diffraction; small angle x-ray scattering.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Atomic and Molecular Structure of Matter"
  },
  "MSE 3010": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "MUSIC 2101": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "NES 2522": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "NS 1150": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "NS 3200": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "NTRES 3311": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ORIE 3150": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ORIE 3300": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ORIE 3310": {
    "description": "\n            A variety of optimization methods stressing extensions of linear programming and its applications but also including topics drawn from integer programming, dynamic programming, and network optimization. Formulation and modeling are stressed as well as numerous applications.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Optimization II"
  },
  "ORIE 3500": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "ORIE 3510": {
    "description": "\n            Uses basic concepts and techniques of random processes to construct models for a variety of problems of practical interest. Topics include the Poisson process, Markov chains, renewal theory, models for queuing, and reliability.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Introduction to Engineering Stochastic Processes I"
  },
  "ORIE 4350": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PAM 2000": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PAM 2100": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PAM 2300": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PAM 3120": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PHIL 1100": {
    "description": "\n            A general introduction to some of the main topics, texts, and methods of philosophy. Topics may include the existence of God, the nature of mind and its relation to the body, causation, free will, knowledge and skepticism, and justice and moral obligation. Readings may be drawn from the history of philosophy and contemporary philosophical literature.\n        ",
    "distribution": "(ETM-AS, KCM-AS)",
    "credits": "3",
    "Name": "Introduction to Philosophy"
  },
  "PHYS 1112": {
    "description": "\n            First course in a three-semester introductory physics sequence. This course is taught in a largely \"flipped', highly interactive manner, with reading preparation and online reading quizzes required for class. Covers the mechanics of particles with focus on kinematics, dynamics, conservation laws, central force fields, periodic motion.&amp;nbsp;Mechanics of many-particle systems: center of mass, rotational mechanics of a rigid body, translational &amp; rotational equilibrium. Temperature, heat, the laws of thermodynamics. At the level of University Physics, Vol. 1, by Young and Freedman.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "3",
    "Name": "Physics I: Mechanics and Heat"
  },
  "PHYS 1116": {
    "description": "\n            First in a three-semester introductory physics sequence. Explores quantitative modeling of the physical world through a study of mechanics. More mathematical than a typical mechanics course - for example, considers how choice of coordinate system (Cartesian, cylindrical, etc.) influences the nature of kinematical equations. Includes kinematics, dynamics, conservation laws, central force fields, periodic motion, and special relativity. At the level of An Introduction to Mechanics by Kleppner and Kolenkow, which assumes a strong mathematical foundation in calculus.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Physics I: Mechanics and Special Relativity"
  },
  "PHYS 2207": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "PHYS 2208": {
    "description": "\n            PHYS 2208 follows PHYS 2207&nbsp;in the two-semester introduction to physics intended for students majoring in biological science, physical science, or mathematics. PHYS 2208 provides a rich exposure to the methods of physics and to the basic analytical and scientific skills required by all scientists. Lectures are highly interactive and illustrated with applications from the sciences, medicine, and everyday life. Labs highlight lecture topics via a hands-on environment. Recitation sections reinforce the lecture topics via cooperative problem-solving. The course content includes electricity and magnetism, optics, and topics from quantum mechanics, nuclear physics and particle physics.&nbsp;\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Fundamentals of Physics II"
  },
  "PHYS 2213": {
    "description": "\n            Second course in a three semester introductory physics sequence. The course emphasizes active learning during class. Video lectures are viewed before class; most class time is devoted to problem-solving.&nbsp; Topics include: electric forces and fields, electric energy and potential, circuits, magnetic forces and fields, magnetic induction, and Maxwell's equations. Taught at a level somewhat higher than University Physics, Vol. 2, by Young and Freedman. The math prerequisite is essential: line, surface, and volume integrals are done routinely and occasional use is made of gradient, divergence, and curl.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Physics II: Electromagnetism"
  },
  "PHYS 2214": {
    "description": "\n            For majors in engineering (including bio-, civil, and environmental engineering), computer and information science, physics, earth and atmospheric science, and other physical and biological sciences who wish to understand the oscillation, wave, and quantum phenomena behind everyday experiences and modern technology including scientific/medical instrumentation. Covers the physics of oscillations and wave phenomena, including driven oscillations and resonance, mechanical waves, sound waves, electromagnetic waves, standing waves, Doppler effect, polarization, wave reflection and transmission, interference, diffraction, geometric optics and optical instruments, wave properties of particles, particles in potential wells, light emission and absorption, and quantum tunneling. With applications to phenomena and measurement technologies in engineering, the physical sciences, and biological sciences.&nbsp; Some familiarity with differential equations, complex representation of sinusoids, and Fourier analysis is desirable but not essential. As with&nbsp;PHYS 1112&nbsp;and PHYS 2213, pre-class preparation involves reading notes and/or watching videos, and in-class activities focus on problem solving, demonstrations, and applications.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Physics III: Oscillations, Waves, and Quantum Physics"
  },
  "PHYS 2217": {
    "description": "\n            Second in a three semester introductory physics sequence. Explores quantitative modeling of the physical world through a study of electricity and magnetism. More mathematical and abstract than a typical introductory electricity and magnetism course. Topics include electrostatics, behavior of matter in electric fields, circuits, magnetic fields, Faraday's law, AC circuits, and electromagnetic waves. Makes substantial use of vector calculus. At the level of Electricity and Magnetism by Purcell.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Physics II: Electricity and Magnetism"
  },
  "PHYS 3316": {
    "description": "\n            Topics include breakdown of classical concepts in microphysics; light quanta and matter waves; Schrödinger equation and solutions for square well, harmonic oscillator, and the hydrogen atom; wave packets, scattering and tunneling effects, angular momentum, spin, and magnetic moments. At the level of An Introduction to Quantum Physics by French and Taylor and Introduction to Quantum Physics by Griffiths.\n        ",
    "distribution": "(PBS-AS, PHS-AS)",
    "credits": "4",
    "Name": "Basics of Quantum Mechanics"
  },
  "PHYS 3318": {
    "description": "\n            Covers Newtonian mechanics of particles and systems of particles, including Lagrangian and Hamiltonian formulations, conservation laws from symmetries, with applications to two-body orbits in a central force, systems undergoing small amplitude oscillations, rigid body motion, motion in non-inertial reference frames, perturbation theory, and nonlinear behavior. Both analytical and numerical methods for solving problems in mechanics are covered. At the level of Classical Mechanics by Goldstein, Mechanics by Landau and Lifshitz, and Analytical Mechanics by Hand and Finch.\n        ",
    "distribution": "(PBS-AS, PHS-AS, SMR-AS)",
    "credits": "4",
    "Name": "Analytical Mechanics"
  },
  "PSYCH 2800": {
    "description": "\n            Introduction to research and theory in social psychology. Topics include social influence, persuasion, and attitude change; culture, social interaction and group phenomena; evolution, altruism, and aggression; stereotyping, prejudice and discrimination; everyday reasoning and judgment.\n        ",
    "distribution": "(ETM-AS, SBA-AS, SSC-AS)",
    "credits": "3",
    "Name": "Introduction to Social Psychology"
  },
  "PSYCH 3250": {
    "description": "\n            A theoretical and empirical approach to the biological, psychological, and social (including cultural and historical) aspects of adult psychopathology. Readings range from Freud to topics in psychopharmacology. The major mental illnesses are covered, including schizophrenia as well as mood, anxiety, and personality disorders. Childhood disorders are not covered.\n        ",
    "distribution": "(ETM-AS, SBA-AS)",
    "credits": "3",
    "Name": "Adult Psychopathology"
  },
  "SOC 1101": {
    "description": "\n            This course is a broad introduction to the field of sociology. Course materials are designed to illustrate the distinctive features of the sociological perspective and to start you thinking sociologically about yourself and the broader social world. To think sociologically is to recognize that being embedded in the world constrains behavior, and that individuals are both social actors and social products. To think sociologically is also to recognize that our contemporary world, with its enduring cultural, political, and economic institutions, is as much a social product as we are. We will begin by covering theoretical and methodological foundations of the sociological perspective.&nbsp; We will go on to explore the concept of social stratification and will survey primary axes of social difference. In the second half of the course we will look more closely at how individuals relate to each other, how social inequality is enacted and reinforced in everyday life, and at the way in which the organization of social life shapes individuals and groups, such as through social networks, residential neighborhoods, schooling, families, and on-line communication.\n        ",
    "distribution": "(SBA-AS, SSC-AS)",
    "credits": "3",
    "Name": "Introduction to Sociology"
  },
  "SOC 1190 (FWS)": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "SOC 3010": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "SPAN 1210": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "SPAN 2090": {
    "description": "\n            This intermediate course develops accurate and idiomatic oral and written expression in a cultural context. Students achieve a higher level of syntactical and lexical competence through reading and discussing literary texts and viewing films. Particular emphasis is on writing and editing academic essays with peer/instructor feedback. Classes are in Spanish and the language is actively used in oral presentations and communicative, creative, and critical-thinking activities. Students review grammar structures on their own, with clarification and support of the instructor. After this course, students may take SPAN 2095.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Intermediate Spanish I (Composition and Conversation)"
  },
  "SPAN 2095": {
    "description": "\n            This advanced-intermediate course is designed to prepare students for study abroad and is required for any Cornell CASA program in a Spanish speaking country.&nbsp; It also serves as an entryway into the major, and advanced-level courses. Students study stylistics, analyze and discuss texts, view films, and acquire advanced reading strategies. Continued emphasis is on writing and editing academic essays with peer and instructor feedback. Classes are in Spanish, and the language is actively used in oral presentations and communicative, creative, and critical-thinking activities. Students review grammar structures on their own, although the instructor may clarify as needed.\n        ",
    "distribution": null,
    "credits": "3",
    "Name": "Spanish Intermediate Composition and Conversation II"
  },
  "STS 1123 (FWS: Seeing City Thru Cinema)": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  },
  "STSCI 2100": {
    "description": "\n            Statistics is about understanding the world through data. We are surrounded by data, so there is a lot to understand. Covers data exploration and display, data gathering methods, probability, and statistical inference methods through contingency tables and linear regression. The emphasis is on thinking scientifically, understanding what is commonly done with data (and doing some of it for yourself), and laying a foundation for further study. Students learn to use statistical software and simulation tools to discover fundamental results. They use computers regularly; the test includes both multimedia materials and a software package. This course does not focus on data from any particular discipline, but will use real-world examples from a wide variety of disciplines and current events.\n        ",
    "distribution": "(MQR-AS, SDS-AS)",
    "credits": "4",
    "Name": "Introductory Statistics"
  },
  "STSCI 2150": {
    "description": "\n            This course provides an introduction to data analysis and statistical inference illustrated with biological applications. The computer labs will teach graphical analysis and statistical computation using R. Topics include graphical display, populations and sampling, probability distributions, expectation and variance, estimation, testing, correlation, regression, contingency tables, and the design of experiments. Emphasis is on concepts and the careful modeling of biological data, so that statistical methods are applied properly, pitfalls are avoided, and sound conclusions are reached.\n        ",
    "distribution": "(MQR-AS, SDS-AS)",
    "credits": "4",
    "Name": "Introductory Statistics for Biology"
  },
  "bme 2": {
    "description": null,
    "credits": null
  },
  "CS 3420": {
    "description": "\n            An introduction to the design of embedded systems, with an emphasis on understanding the interaction between hardware, software, and the physical world. Topics covered include assembly language programming, interrupts, I/O, concurrency management, scheduling, resource management, and real-time constraints.\n        ",
    "distribution": null,
    "credits": "4",
    "Name": "Embedded Systems"
  },
  "CS 4152": {
    "description": "\n            Project-based follow-up course to CS 3152. Students work in a multidisciplinary team to develop a game that incorporates innovative game technology. Advanced topics include 3D game development, mobile platforms, multiplayer gaming, and nontraditional input devices. There is a special emphasis on developing games that can be submitted to festivals and competitions.\n        ",
    "distribution": "(SMR-AS)",
    "credits": "3",
    "Name": "Advanced Topics in Computer Game Architecture"
  },
  "CS 4411": {
    "description": "\n            Studies the practical aspects of operating systems through the design and implementation of an operating system kernel that supports multiprogramming, virtual memory, and various input-output devices. All the programming for the project is in a high-level language.\n        ",
    "distribution": null,
    "credits": "2",
    "Name": "Practicum in Operating Systems"
  },
  "CS 4760": {
    "description": -1,
    "distribution": null,
    "credits": -1,
    "Name": -1
  }
}